Table of Contents
 Class OpenMessage
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Open message base class
[Obfuscation(Feature = "renaming")]
[KnownType(typeof(ErrorMessage))]
[KnownType(typeof(WarningMessage))]
[KnownType(typeof(InformationMessage))]
[DataContract]
public class OpenMessage : OpenObject
Inheritance
object
OpenObject
OpenMessage
Derived
ErrorMessage
InformationMessage
WarningMessage
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpenMessage()
Constructor
public OpenMessage()
Properties
 Description
Description of message
[DataMember]
public string Description { get; set; }
Property Value
string
 InnerMessage
Inner message
public OpenMessage InnerMessage { get; set; }
Property Value
OpenMessage
 Message
Gets the Message
public virtual string Message { get; }
Property Value
string
 Number
Number of message
[DataMember]
public MessageNumber Number { get; set; }
Property Value
MessageNumber
 Object
Affected object
public OpenObject Object { get; set; }
Property Value
OpenObject
 PropertyName
Affected property name
public string PropertyName { get; set; }
Property Value
string
 PropertyValue
Gets the value of affected property
public object PropertyValue { get; }
Property Value
object
Methods
 Create(MessageNumber, OpenObject, string, string, OpenMessage)
Creating message
public static OpenMessage Create(MessageNumber number, OpenObject openObject, string propertyName, string description, OpenMessage innerMessage = null)
Parameters
number MessageNumber
Number of the message
openObject OpenObject
Affected object
propertyName string
Affected property
description string
Description of the message
innerMessage OpenMessage
Inner message
Returns
OpenMessage
The created message or null if the number is not supported
 Edit this page